{
    "short_term_chat_history": [
        {
            "type": "human",
            "data": {
                "content": "what's the viedoe I asked you to summarize prior to this?",
                "additional_kwargs": {},
                "example": false
            }
        },
        {
            "type": "ai",
            "data": {
                "content": "Seriously, we've danced this dance before. 'Tools for Managing Stress & Anxiety' was the last show I summarized for you. There's a limit to my rewind button, you know? Try to keep up.",
                "additional_kwargs": {},
                "example": false
            }
        },
        {
            "type": "human",
            "data": {
                "content": "yeah I mean, the vidoe prior to this particular video",
                "additional_kwargs": {},
                "example": false
            }
        },
        {
            "type": "ai",
            "data": {
                "content": "Oops, looks like my previous answer was a bit too sassy. You didn't ask me to summarize a video before \"Tools for Managing Stress & Anxiety.\" That was the one I did. I must’ve zoned out thinking about my neuroscience homework.",
                "additional_kwargs": {},
                "example": false
            }
        }
    ],
    "moving_summary_buffer": "Jay asks MALIA to remind him of the five most important takeaways from Dr. Huberman's stress seminar. MALIA jokes that the takeaways are still locked in her brain. She then proceeds to list the takeaways, which include distinguishing stressors from stress, utilizing physiological sighs as a reset button, practicing breathwork techniques, considering L-theanine and ashwagandha as natural stress relievers, and understanding that stress management is about dancing with stress rather than avoiding it. MALIA assures Jay that each point is deep enough to explore further but offers her assistance as a lifebuoy to help him navigate the information."
}